Pandas

Pandas Series

A series is a one-dimensional labeled  array capable of holding any data type. The axis labels are collectively called the index.

Creating Series

There are multiple way to create a pandas Series :

In [22]:
!pip install pandas numpy

Requirement already satisfied: pandas in /home/lakshya/anaconda3/lib/python3.11/site-packages (2.2.1)
Requirement already satisfied: numpy in /home/lakshya/anaconda3/lib/python3.11/site-packages (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/lakshya/anaconda3/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /home/lakshya/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.7 in /home/lakshya/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /home/lakshya/anaconda3/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [23]:

import numpy as np
import pandas as pd

In [24]:
labels = ['a', 'b', 'c', 'd']
my_list = [10, 20, 30, 40]
arr = np.array([10, 20, 30, 40])
d = {1:10, 2:20, 3:30, 4:40}

In [25]:
pd.Series(my_list)

0    10
1    20
2    30
3    40
dtype: int64

In [26]:
pd.Series(my_list, index=labels)  # Series from list with custom index

a    10
b    20
c    30
d    40
dtype: int64

In [27]:
#Creating Series from NumPy array
pd.Series(arr, index=labels)  # Series from NumPy array with custom index

a    10
b    20
c    30
d    40
dtype: int64

In [28]:
# Series from Dictionary
pd.Series(d)  # Series from dictionary with default index

1    10
2    20
3    30
4    40
dtype: int64

DataFrame

When two or more series joins together it made DataFrame...

Creating a Dataframe

In [29]:
# When two or more series joins together it made DataFrame...

data = {
    'Name' : ['John','Anna','Peter','Linda'],
    'Age': [28,34,29,42],
    'City': ['New York','Paris','Berlin','London'],
    'Salary': [65000,70000,62000,85000]
}

df = pd.DataFrame(data)  # Creating DataFrame from dictionary

In [30]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [31]:
# Creating a Dataframe using a list of lists

data_lists = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]

df2 = pd.DataFrame(data_lists)
columns = ['Name', 'Age', 'City', 'Salary']
df2 = pd.DataFrame(data_lists, columns=columns)  # Creating DataFrame from list of lists with column names

In [32]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [33]:
df2['Name'] # Accessing the 'Name' column

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [34]:
df2[['Name',"City"]] # Accessing multiple columns

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

Creating a Column

In [35]:
# Adding a new column to the DataFrame 

df2['Designation'] = ['Engineer', 'Designer', 'Manager', 'Analyst']  # Adding a new column
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000    Engineer
1   Anna   34     Paris   70000    Designer
2  Peter   29    Berlin   62000     Manager
3  Linda   42    London   85000     Analyst

Removing a Column in DataFrame

In [36]:
df2.drop('Designation', axis=1, inplace=True)  # Removing the 'Designation' column
# inplace=True modifies the original DataFrame without creating a new one
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [37]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

Removiing Multiple Column

In [38]:
df2.drop(['Age', 'City'], axis=1)  # Removing multiple columns

    Name  Salary
0   John   65000
1   Anna   70000
2  Peter   62000
3  Linda   85000

Removing Row

In [39]:
df2.drop(0,axis=0, inplace=True)  # Removing the first row
df2  # Displaying the DataFrame after removing the row

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

Selecting a Row

In [40]:
df2

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

In [41]:
df2.loc[[1,3]]  # Selecting the second row using .loc

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [42]:
df2.iloc[1]  # Selecting the second row using .iloc

Name       Peter
Age           29
City      Berlin
Salary     62000
Name: 2, dtype: object

In [47]:
df2

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

Selecting the subset of Rows and Columns

In [ ]:
df2.loc[[1,2]][['City','Salary']] # Selecting specific columns from specific rows using .loc

     City  Salary
1   Paris   70000
2  Berlin   62000

In [50]:
df2.loc[[2,3]][['Name','Age']]

    Name  Age
2  Peter   29
3  Linda   42

Conditional Selection

In [51]:
df2

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

In [52]:
#I want only those rows where the Age is greater than 30

df2[df2['Age'] > 30]  # Conditional selection based on Age column

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [59]:
#I onlt want those where the Age is greater than 30 and City is 'paris

df2[(df2['Age'] > 30 )& (df2['City'] == 'Paris')] # Conditional selection with multiple conditions

   Name  Age   City  Salary
1  Anna   34  Paris   70000

Missing data

In [60]:
import numpy as np
import pandas as pd

Finding Missing Data

In [72]:
data = {
    'A': [1,2,np.nan,4,5],
    'B': [1,2,3,4,5],
    'C': [1,2,3,np.nan,np.nan],
    'D': [1,np.nan,np.nan,np.nan,5]
}

In [73]:
df = pd.DataFrame(data)  # Creating DataFrame from dictionary
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [74]:
df.isna() # Checking for missing values in the DataFrame

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [75]:
df.isna().sum()  # Summing up the number of missing values in each column

A    1
B    0
C    2
D    3
dtype: int64

In [76]:
df.isna().any() # Checking if any missing values exist in each column

A     True
B    False
C     True
D     True
dtype: bool

Remove Missing Value

In [77]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [78]:
df.dropna()  # Removing rows with any missing values

     A  B    C    D
0  1.0  1  1.0  1.0

In [79]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [81]:
df.dropna(thresh=3) # Removing rows with less than 3 non-NA values

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

Filling the Missinng Data

In [82]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [83]:
df.fillna(0)  # Filling missing values with 0

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [84]:
values = {'A':0, 'B':5, 'C':8, 'D':4}  # Dictionary for filling missing values
df.fillna(value=values)  # Filling missing values with specified values from the dictionary

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  4.0
2  0.0  3  3.0  4.0
3  4.0  4  8.0  4.0
4  5.0  5  8.0  5.0

In [85]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [86]:
df.fillna(df.mean())  # Filling missing values with the mean of each column

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  3.0
2  3.0  3  3.0  3.0
3  4.0  4  2.0  3.0
4  5.0  5  2.0  5.0